{
  "welcome": "Welcome to Trip Diary!",
  "language": "Language",
  "login": {
    "title": "Trip Diary",
    "subtitle": "Record travel, share life",
    "loginTitle": "Login",
    "registerTitle": "Register",
    "email": "Please enter your email",
    "password": "Please enter your password",
    "verifyCode": "Please enter verification code",
    "getVerifyCode": "Get Code",
    "resendAfter": "s to resend",
    "loginButton": "Login",
    "registerButton": "Register",
    "noAccount": "No account?",
    "register": "Register now",
    "hasAccount": "Have an account?",
    "goLogin": "Login now",
    "agreement": "By login or register, you agree to our",
    "userAgreement": "User Agreement",
    "and": "and",
    "privacyPolicy": "Privacy Policy",
    "emailRequired": "Email is required",
    "emailInvalid": "Please enter a valid email address",
    "passwordRequired": "Password is required",
    "verifyCodeRequired": "Verification code is required",
    "codeSent": "Verification code sent",
    "sendCodeFailed": "Failed to send verification code, please try again later",
    "registerFailed": "Registration failed, please try again later",
    "loginFailed": "Login failed, please check your email and password",
    "loginSuccess": "Login successful",
    "registerSuccess": "Registration successful",

    "appName": "Trip Diary",
    "loginTab": "Login",
    "registerTab": "Register",
    "emailPlaceholder": "Email address",
    "passwordPlaceholder": "Password",
    "codePlaceholder": "Verification code",
    "forgotPassword": "Forgot password?",
    "login": "Login",
    "sendCode": "Send Code",
    "orUse": "Or use",
    "footerTerms": "Terms of Service",
    "footerPrivacy": "Privacy Policy",
    "footerHelp": "Help Center",
    "footerVersion": "Version 1.0.0"
  },
  "legal": {
    "userAgreement": "User Agreement",
    "privacyPolicy": "Privacy Policy",
    "personalInfoCollection": "Personal Information Collection List",
    "thirdPartySharing": "Third Party Information Sharing List"
  },
  "userAgreement": {
    "title": "Trip Diary User Agreement",
    "welcome": "Welcome to the 'Trip Diary' application. This User Agreement ('Agreement') is a contract between you and Trip Diary App ('we') regarding Trip Diary services and related matters. Please read this Agreement carefully. By clicking the 'Agree' button or otherwise choosing to accept this Agreement, you acknowledge that you have fully read, understood, and accepted all the terms of this Agreement.",
    "serviceIntro": {
      "title": "1. Service Introduction",
      "content": "Trip Diary is a mobile application that helps users record their travel experiences, share their journeys, and interact with other travel enthusiasts. We provide services including but not limited to creating and sharing travel diaries, uploading travel photos and videos, community interaction, and communication."
    },
    "account": {
      "title": "2. Account Registration and Security",
      "content1": "2.1 You need to register an account before using our service. You promise to provide true, accurate, and complete personal information during the registration process and update your information promptly when changes occur.",
      "content2": "2.2 You are responsible for account security, including safeguarding your account and password, changing your password regularly, and ensuring you log out at the end of each internet session.",
      "content3": "2.3 Your account is for your personal use only and may not be lent, transferred, or used by others. Any loss resulting from your active disclosure or personal reasons shall be borne by you."
    },
    "content": {
      "title": "3. User Content",
      "content1": "3.1 All content you publish through Trip Diary (including but not limited to photos, videos, text, etc.) must comply with relevant laws and regulations and must not contain pornography, violence, terrorism, politically sensitive, or other inappropriate information.",
      "content2": "3.2 You guarantee that you have legal rights to the content you publish, including copyright or appropriate authorization. Any legal disputes arising from your published content shall be your sole responsibility.",
      "content3": "3.3 We have the right but not the obligation to review content published by users. For content that violates laws, regulations, or this Agreement, we have the right to delete it."
    },
    "ip": {
      "title": "4. Intellectual Property",
      "content1": "4.1 The intellectual property rights of Trip Diary and its related software, technology, programs, content, etc., belong to us.",
      "content2": "4.2 Without our explicit written permission, you may not copy, modify, compile, sell, or otherwise reuse any of our resources."
    },
    "service": {
      "title": "5. Service Changes, Interruptions, or Termination",
      "content1": "5.1 We reserve the right to change, interrupt, or terminate part or all of the services at any time.",
      "content2": "5.2 If you violate this Agreement or relevant laws and regulations, we have the right to suspend or terminate services to you."
    },
    "disclaimer": {
      "title": "6. Disclaimer",
      "content1": "6.1 You understand and agree that Trip Diary services may be affected by various factors. We do not guarantee that the service will be uninterrupted or timely, secure, or accurate.",
      "content2": "6.2 We are not responsible for service interruptions or other defects caused by force majeure or reasons beyond our control."
    },
    "modification": {
      "title": "7. Agreement Modifications",
      "content": "We have the right to modify the terms of this Agreement when necessary. You can review the latest version of the Agreement in our application. After the terms of this Agreement change, if you continue to use our services, it is deemed that you have accepted the modified Agreement."
    },
    "law": {
      "title": "8. Applicable Law and Dispute Resolution",
      "content": "The conclusion, execution, interpretation of this Agreement, and the resolution of disputes shall be governed by the laws of the People's Republic of China. If the parties have disputes regarding the content or implementation of this Agreement, they should resolve them through friendly negotiation; if negotiation fails, either party may file a lawsuit with a court having jurisdiction."
    },
    "contact": {
      "title": "9. Contact Us",
      "content": "If you have any questions, comments, or suggestions about this Agreement or our services, please contact us through the 'Help and Feedback' feature in the application or by sending an email to support@tripdiary.com."
    }
  },
  "privacyPolicy": {
    "title": "Trip Diary Privacy Policy",
    "welcome": "Welcome to the 'Trip Diary' application. We deeply understand the importance of personal information to you and will do our utmost to protect the security of your personal information. We have formulated this Privacy Policy to explain to you how we collect, use, store, and share this information, as well as the ways we provide for you to access, update, control, and protect this information.",
    "intro": "This Privacy Policy is closely related to the Trip Diary services you use. We hope you will read it carefully and, when necessary, make choices you deem appropriate according to the guidance of this Privacy Policy.",
    "collection": {
      "title": "1. Information We Collect",
      "subtitle1": "1.1 Information you provide:",
      "content1": "- Account information: When you register for a Trip Diary account, you need to provide information such as phone number and email.",
      "content2": "- Personal profile: You can provide information such as nickname, avatar, gender, birthday, and personal bio when using our services.",
      "content3": "- User content: Content you create, upload, or share through our services, such as photos, videos, diary text, comments, etc.",
      "subtitle2": "1.2 Information we automatically collect:",
      "content4": "- Device information: We may collect information about device model, operating system version, device settings, unique device identifiers, etc.",
      "content5": "- Log information: When you use our services, the server automatically records some information, including IP address, access date and time, application crash information, etc.",
      "content6": "- Location information: With your authorization, we may collect and process information about your actual location to provide location-based services, such as travel location tags."
    },
    "usage": {
      "title": "2. Use of Information",
      "subtitle1": "2.1 We may use the collected information for the following purposes:",
      "content1": "- To provide, maintain, and improve our services.",
      "content2": "- To process and respond to your inquiries or requests.",
      "content3": "- To send you service-related notices, such as technical notices, updates, security alerts, etc.",
      "content4": "- To conduct internal research and development to improve user experience.",
      "content5": "- To monitor and analyze trends, usage, and activities to improve our services.",
      "subtitle2": "2.2 We will not provide, sell, rent, share, or trade your personal information to any unrelated third party, unless we obtain your permission in advance, or the third party and we separately or jointly provide services to you, and after the service is completed, it will be prohibited from accessing all this information, including that which it was previously able to access."
    },
    "sharing": {
      "title": "3. Sharing of Information",
      "subtitle": "3.1 We may share your personal information in the following circumstances:",
      "content1": "- Sharing with explicit consent: After obtaining your explicit consent, we will share your personal information with other parties.",
      "content2": "- In the case where it is necessary to provide your personal information in accordance with the requirements of laws and regulations, mandatory administrative or judicial requirements, we may publicly disclose your personal information based on the type of personal information required and the method of disclosure.",
      "content3": "- Sharing with affiliated companies: Your personal information may be shared with our affiliated companies. We will only share necessary personal information, which is subject to the purposes described in this Privacy Policy.",
      "content4": "- Sharing with authorized partners: We may share certain personal information with partners to provide services you request or to process personal information on our behalf."
    },
    "storage": {
      "title": "4. Information Storage",
      "subtitle1": "4.1 Location of information storage",
      "content1": "In accordance with laws and regulations, we will store user personal information collected within China's borders in mainland China.",
      "subtitle2": "4.2 Duration of information storage",
      "content2": "We will only retain your personal information for the period necessary to fulfill the purposes outlined in this policy, unless laws require or permit retention of this information for a longer period."
    },
    "security": {
      "title": "5. Information Security",
      "content1": "5.1 We use various security technologies and procedures to prevent information loss, misuse, unauthorized viewing, or disclosure. For example, in some services, we will use encryption technology (such as SSL) to protect the personal information you provide. However, please understand that due to technological limitations and various malicious means that may exist, even though we have done our best to strengthen security measures, we cannot always guarantee 100% security of information.",
      "content2": "5.2 You need to understand that the systems and communication networks you use to access our services may have problems due to factors beyond our control."
    },
    "rights": {
      "title": "6. Your Rights",
      "intro": "In accordance with relevant Chinese laws, regulations, standards, and common practices in other countries and regions, we ensure that you exercise the following rights over your personal information:",
      "access": {
        "title": "6.1 Accessing your personal information",
        "content1": "You have the right to access your personal information, except in cases stipulated by laws and regulations. You can access your personal information yourself through the following methods:",
        "content2": "- Account information — If you wish to access or edit personal profile information in your account, you can do so by accessing 'Personal Center' in the application."
      },
      "correction": {
        "title": "6.2 Correcting your personal information",
        "content": "When you find errors in the personal information we process about you, you have the right to request us to make corrections. You can submit a correction request through the methods listed in '6.1 Accessing your personal information.'"
      },
      "deletion": {
        "title": "6.3 Deleting your personal information",
        "content": "You may request us to delete your personal information in the following situations:",
        "content1": "- If our processing of personal information violates laws and regulations;",
        "content2": "- If we collect and use your personal information without obtaining your consent;",
        "content3": "- If our processing of personal information violates our agreement with you;",
        "content4": "- If you no longer use our products or services, or you have canceled your account;",
        "content5": "- If we no longer provide products or services to you."
      }
    },
    "changes": {
      "title": "7. Changes to Privacy Policy",
      "content": "We may update this Privacy Policy from time to time. When we do so, we will post the updated version in the application and update the 'Last Updated' date at the top of this Privacy Policy. If we make material changes to this Privacy Policy, we will also notify you by posting a notice on the application's homepage or by sending you a notification. Continued use of our services after the latest version of this Privacy Policy takes effect indicates your acceptance of the revised Privacy Policy."
    },
    "contact": {
      "title": "8. Contact Us",
      "content": "If you have any questions, comments, or suggestions regarding this Privacy Policy, please contact us through the following methods:",
      "email": "Email: privacy@tripdiary.com",
      "phone": "Phone: 400-123-4567",
      "response": "We will respond to you within 15 working days of receiving your inquiry."
    }
  },
  "home": {
    "refreshIdle": "",
    "refreshReady": "Release to refresh",
    "refreshing": "Refreshing",
    "refreshSuccess": "",
    "searchPlaceholder": "Search diaries, @user, #tag",
    "searchBtn": "Search"
  }
}
